# Definitions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
Definitions Constructor
Definitions Class See Also
---
Constructs an empty set of parameter definitions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Definitions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
Definitions()
```

# See Also
Definitions Class
Autodesk.Revit.DB Namespace